# declensions.py

# Masculine nouns ending in 'अ'
a_stem_masc_declension = {
    'प्रथमा':   ['ः', 'ौ', 'ाः'],
    'द्वितीया': ['म्', 'ौ', 'ान्'],
    'तृतीया':  ['ेन', 'ाभ्याम्', 'ैः'],
    'चतुर्थी': ['ाय', 'ाभ्याम्', 'ेभ्यः'],
    'पञ्चमी':  ['ातः', 'ाभ्याम्', 'ेभ्यः'],
    'षष्ठी':   ['स्य', 'योः', 'ानाम्'],
    'सप्तमी':  ['े', 'योः', 'ेषु'],
    'संबोधन': ['', 'ौ', 'ाः']
}



# Feminine nouns ending in 'आ'
ā_stem_fem_declension = {
    'प्रथमा':   ['ा', 'े', 'ाः'],
    'द्वितीया': ['ाम्', 'े', 'ाः'],
    'तृतीया':  ['या', 'ाभ्याम्', 'ाभिः'],
    'चतुर्थी': ['ायै', 'ाभ्याम्', 'ाभ्यः'],
    'पञ्चमी':  ['ायाः', 'ाभ्याम्', 'ाभ्यः'],
    'षष्ठी':   ['ायाः', 'योः', 'ानाम्'],
    'सप्तमी':  ['ायाम्', 'योः', 'ासु'],
    'संबोधन': ['े', 'े', 'ाः']
}

# Neuter nouns ending in 'अ'
a_stem_neut_declension = {
    'प्रथमा':   ['म्', 'े', 'ानि'],
    'द्वितीया': ['म्', 'े', 'ानि'],
    'तृतीया':  ['ेन', 'ाभ्याम्', 'ैः'],
    'चतुर्थी': ['ाय', 'ाभ्याम्', 'ेभ्यः'],
    'पञ्चमी':  ['ातः', 'ाभ्याम्', 'ेभ्यः'],
    'षष्ठी':   ['स्य', 'योः', 'ानाम्'],
    'सप्तमी':  ['े', 'योः', 'ेषु'],
    'संबोधन': ['म्', 'े', 'ानि']
}

# Personal pronoun: 'अहम्' (asmad)
asmad_declension = {
    'प्रथमा':   ['अहम्', 'आवाम्', 'वयम्'],
    'द्वितीया': ['माम्', 'आवाम्', 'अस्मान्'],
    'तृतीया':  ['मया', 'आवाभ्याम्', 'अस्माभिः'],
    'चतुर्थी': ['मह्यम्', 'आवाभ्याम्', 'अस्मभ्यम्'],
    'पञ्चमी':  ['मत्', 'आवाभ्याम्', 'अस्मत्'],
    'षष्ठी':   ['मम', 'आवयोः', 'अस्माकम्'],
    'सप्तमी':  ['मयि', 'आवयोः', 'अस्मासु'],
}

# Personal pronoun: 'त्वम्' (yuṣmad)
yushmad_declension = {
    'प्रथमा':   ['त्वम्', 'युवाम्', 'यूयम्'],
    'द्वितीया': ['त्वाम्', 'युवाम्', 'युष्मान्'],
    'तृतीया':  ['त्वया', 'युवाभ्याम्', 'युष्माभिः'],
    'चतुर्थी': ['तुभ्यम्', 'युवाभ्याम्', 'युष्मभ्यम्'],
    'पञ्चमी':  ['त्वत्', 'युवाभ्याम्', 'युष्मत्'],
    'षष्ठी':   ['तव', 'युवयोः', 'युष्माकम्'],
    'सप्तमी':  ['त्वयि', 'युवयोः', 'युष्मासु']
}
